const questions = ["Дерево (2 определения)", "Граф блоков и точек сочленения", "Граф компонент реберной двусвязности", "Остов графа", "Цикломатическое число",
        "Цикл, ассоциированный с остовом", "Фундаментальная система циклов", "Минимальное остовное дерево", "Безопасное ребро", "Разрез",
        "Ребро пересекающее разрез", "Лемма о безопасном ребре(суть)", "Расстояние между двумя вершинами графа", "Диаметр графа", "Центр графа",
        "Радиус граф", "Кратчайший путь между двумя вершинами", "Теорема о поиске числа путей заданной длины по матрице смежности орграфа", "Лемма о белых путях",
        "Эйлеров путь", "Отличие эйлерова и полуэйлерова графов", "Эквивалентные определения эйлерова графа", "Теорема о покрытии ребер графа путями",
        "Критерий эйлеровости", "Произвольно вычерчиваемый граф", "Теорема о произвольно вычерчиваемости", "Гамильтонов путь", "Теорема Оре", "Теорема Дирака",
        "Теорема Гуйя - Ури", "Для любого ли гамильтонова графа будут выполняться условия теорем о гамильтоновости и почему?",
        "Определение сочетания(не формулой)", "Определение размещения(не формулой)", "Определение перестановки(не формулой)", "Отличие перестановок и размещений",
        "Принцип Дирихле", "Принцип сложения", "Принцип умножения", "Принцип включения - исключения", "Лексикографический порядок на строках"
    ]
;

let i = 0;
let is_again = true;

function on_click_button() {
    if (is_again) {
        questions.sort(() => Math.random() - 0.5);
        is_again = false;
    }

    if (i < questions.length)
        return (i + 1) + ") " + questions[i++];
    else {
        is_again = confirm("Вопросы закончились, хочешь заново?");
        stop_timer();
        if (is_again) {
            i = 0;
            first_time_used = true;
            return "Ну что, ещё по одной?";
        } else {
            stop_timer();
            alert("Не очень-то и хотелось");
            i = 0;
            is_again = true;
            first_time_used = true;
            return "Вопросов нема";
        }
    }
}