const questions = ["Дерево (2 определения)", "Граф блоков и точек сочленения", "Граф компонент реберной двусвязности", "Остов графа", "Цикломатическое число",
        "Цикл, ассоциированный с остовом", "Фундаментальная система циклов", "Минимальное остовное дерево", "Безопасное ребро", "Разрез",
        "Ребро пересекающее разрез", "Лемма о безопасном ребре (суть)", "Расстояние между двумя вершинами графа", "Диаметр графа", "Центр графа",
        "Радиус графа", "Кратчайший путь между двумя вершинами", "Теорема о поиске числа путей заданной длины по матрице смежности орграфа", "Лемма о белых путях",
        "Эйлеров путь", "Отличие эйлерова и полуэйлерова графов", "Эквивалентные определения эйлерова графа", "Теорема о покрытии ребер графа путями",
        "Критерий эйлеровости", "Произвольно вычерчиваемый граф", "Теорема о произвольно вычерчиваемости", "Гамильтонов путь", "Теорема Оре", "Теорема Дирака",
        "Теорема Гуйя - Ури", "Для любого ли гамильтонова графа будут выполняться условия теорем о гамильтоновости и почему?",
        "Определение сочетания (не формулой)", "Определение размещения (не формулой)", "Определение перестановки (не формулой)", "Отличие перестановок и размещений",
        "Принцип Дирихле", "Принцип сложения", "Принцип умножения", "Принцип включения - исключения", "Лексикографический порядок на строках"
    ]
;

let questions_counter = 0, is_again = true;

function on_click_button() {
    if (questions_counter === 40) {
        console.log(questions_counter);
        questions_counter = 41;
        stop_timer();
        is_again = true;
        document.getElementById("questions_button").innerHTML = "Ещё раз!";
        return "Вопросов больше нет";
    }
    document.getElementById("questions_button").innerHTML = "Следующий вопрос";

    if (is_again) {
        questions.sort(() => Math.random() - 0.5);
        is_again = false;
        questions_counter = -1;
        first_time_used = true;
        set_seconds(10);
        document.getElementById("button1").innerHTML = on_click_button();
    }

    if (questions_counter < questions.length)
        return (questions_counter + 1) + ") " + questions[questions_counter++];
    else {
        document.getElementById("questions_button").innerHTML = "Ещё раз!"
        questions_counter = 0;
        first_time_used = true;
        set_seconds(0);
    }
}